backend/tests/stress/reports/20260528-165420/booking_create.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/bahtiyarelik/Developer/diploma/backend/tests/stress/scenarios/booking_create.js
        output: -

     scenarios: (100.00%) 1 scenario, 60 max VUs, 1m0s max duration (incl. graceful stop):
              * booking: 20.00 iterations/s for 30s (maxVUs: 30-60, gracefulStop: 30s)


running (0m01.0s), 01/30 VUs, 18 complete and 0 interrupted iterations
booking   [   3% ] 01/30 VUs  00.9s/30s  20.00 iters/s

running (0m02.0s), 01/30 VUs, 38 complete and 0 interrupted iterations
booking   [   6% ] 01/30 VUs  01.9s/30s  20.00 iters/s

running (0m03.0s), 01/30 VUs, 58 complete and 0 interrupted iterations
booking   [  10% ] 01/30 VUs  02.9s/30s  20.00 iters/s

running (0m04.0s), 01/30 VUs, 78 complete and 0 interrupted iterations
booking   [  13% ] 01/30 VUs  03.9s/30s  20.00 iters/s

running (0m05.0s), 01/30 VUs, 98 complete and 0 interrupted iterations
booking   [  16% ] 01/30 VUs  04.9s/30s  20.00 iters/s

running (0m06.0s), 01/30 VUs, 118 complete and 0 interrupted iterations
booking   [  20% ] 01/30 VUs  05.9s/30s  20.00 iters/s

running (0m07.0s), 01/30 VUs, 138 complete and 0 interrupted iterations
booking   [  23% ] 01/30 VUs  06.9s/30s  20.00 iters/s

running (0m08.0s), 01/30 VUs, 158 complete and 0 interrupted iterations
booking   [  26% ] 01/30 VUs  07.9s/30s  20.00 iters/s

running (0m09.0s), 01/30 VUs, 178 complete and 0 interrupted iterations
booking   [  30% ] 01/30 VUs  08.9s/30s  20.00 iters/s

running (0m10.0s), 00/30 VUs, 199 complete and 0 interrupted iterations
booking   [  33% ] 00/30 VUs  09.9s/30s  20.00 iters/s

running (0m11.0s), 00/30 VUs, 219 complete and 0 interrupted iterations
booking   [  36% ] 00/30 VUs  10.9s/30s  20.00 iters/s

running (0m12.0s), 01/30 VUs, 238 complete and 0 interrupted iterations
booking   [  40% ] 01/30 VUs  11.9s/30s  20.00 iters/s

running (0m13.0s), 01/30 VUs, 258 complete and 0 interrupted iterations
booking   [  43% ] 01/30 VUs  12.9s/30s  20.00 iters/s

running (0m14.0s), 01/30 VUs, 278 complete and 0 interrupted iterations
booking   [  46% ] 01/30 VUs  13.9s/30s  20.00 iters/s

running (0m15.0s), 01/30 VUs, 298 complete and 0 interrupted iterations
booking   [  50% ] 01/30 VUs  14.9s/30s  20.00 iters/s

running (0m16.0s), 01/30 VUs, 318 complete and 0 interrupted iterations
booking   [  53% ] 01/30 VUs  15.9s/30s  20.00 iters/s

running (0m17.0s), 01/30 VUs, 338 complete and 0 interrupted iterations
booking   [  56% ] 01/30 VUs  16.9s/30s  20.00 iters/s

running (0m18.0s), 01/30 VUs, 358 complete and 0 interrupted iterations
booking   [  60% ] 01/30 VUs  17.9s/30s  20.00 iters/s

running (0m19.0s), 01/30 VUs, 378 complete and 0 interrupted iterations
booking   [  63% ] 01/30 VUs  18.9s/30s  20.00 iters/s

running (0m20.0s), 01/30 VUs, 398 complete and 0 interrupted iterations
booking   [  66% ] 01/30 VUs  19.9s/30s  20.00 iters/s

running (0m21.0s), 01/30 VUs, 418 complete and 0 interrupted iterations
booking   [  70% ] 01/30 VUs  20.9s/30s  20.00 iters/s

running (0m22.0s), 01/30 VUs, 438 complete and 0 interrupted iterations
booking   [  73% ] 01/30 VUs  21.9s/30s  20.00 iters/s

running (0m23.0s), 00/30 VUs, 459 complete and 0 interrupted iterations
booking   [  76% ] 00/30 VUs  22.9s/30s  20.00 iters/s

running (0m24.0s), 01/30 VUs, 478 complete and 0 interrupted iterations
booking   [  80% ] 01/30 VUs  23.9s/30s  20.00 iters/s

running (0m25.0s), 01/30 VUs, 498 complete and 0 interrupted iterations
booking   [  83% ] 01/30 VUs  24.9s/30s  20.00 iters/s

running (0m26.0s), 01/30 VUs, 518 complete and 0 interrupted iterations
booking   [  86% ] 01/30 VUs  25.9s/30s  20.00 iters/s

running (0m27.0s), 01/30 VUs, 538 complete and 0 interrupted iterations
booking   [  90% ] 01/30 VUs  26.9s/30s  20.00 iters/s

running (0m28.0s), 01/30 VUs, 558 complete and 0 interrupted iterations
booking   [  93% ] 01/30 VUs  27.9s/30s  20.00 iters/s

running (0m29.0s), 01/30 VUs, 578 complete and 0 interrupted iterations
booking   [  96% ] 01/30 VUs  28.9s/30s  20.00 iters/s

running (0m30.0s), 01/30 VUs, 598 complete and 0 interrupted iterations
booking   [ 100% ] 01/30 VUs  29.9s/30s  20.00 iters/s


  █ THRESHOLDS 

    http_req_duration{name:/api/bookings}
    ✓ 'p(95)<300' p(95)=17.27ms
    ✓ 'p(99)<600' p(99)=21.72ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 600     19.939277/s
    checks_succeeded...: 100.00% 600 out of 600
    checks_failed......: 0.00%   0 out of 600

    ✓ create booking 2xx

    HTTP
    http_req_duration..............: avg=9.93ms  min=3.75ms med=8.5ms  max=81.97ms p(90)=15.76ms p(95)=17.32ms
      { expected_response:true }...: avg=9.93ms  min=3.75ms med=8.5ms  max=81.97ms p(90)=15.76ms p(95)=17.32ms
      { name:/api/bookings }.......: avg=9.82ms  min=3.75ms med=8.5ms  max=33.93ms p(90)=15.73ms p(95)=17.27ms
    http_req_failed................: 0.00%  0 out of 602
    http_reqs......................: 602    20.005741/s

    EXECUTION
    iteration_duration.............: avg=10.18ms min=3.85ms med=8.89ms max=34.3ms  p(90)=16.28ms p(95)=17.67ms
    iterations.....................: 600    19.939277/s
    vus............................: 1      min=0        max=1 
    vus_max........................: 30     min=30       max=30

    NETWORK
    data_received..................: 350 kB 12 kB/s
    data_sent......................: 340 kB 11 kB/s



running (0m30.1s), 00/30 VUs, 600 complete and 0 interrupted iterations
booking ✓ [ 100% ] 00/30 VUs  30s  20.00 iters/s