backend/tests/stress/reports/20260528-165420/chat_burst.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/bahtiyarelik/Developer/diploma/backend/tests/stress/scenarios/chat_burst.js
        output: -

     scenarios: (100.00%) 1 scenario, 60 max VUs, 1m0s max duration (incl. graceful stop):
              * chat: 20.00 iterations/s for 30s (maxVUs: 25-60, gracefulStop: 30s)


running (0m01.0s), 00/25 VUs, 19 complete and 0 interrupted iterations
chat   [   3% ] 00/25 VUs  00.9s/30s  20.00 iters/s

running (0m02.0s), 00/25 VUs, 39 complete and 0 interrupted iterations
chat   [   6% ] 00/25 VUs  01.9s/30s  20.00 iters/s

running (0m03.0s), 00/25 VUs, 59 complete and 0 interrupted iterations
chat   [  10% ] 00/25 VUs  02.9s/30s  20.00 iters/s

running (0m04.0s), 00/25 VUs, 79 complete and 0 interrupted iterations
chat   [  13% ] 00/25 VUs  03.9s/30s  20.00 iters/s

running (0m05.0s), 00/25 VUs, 99 complete and 0 interrupted iterations
chat   [  16% ] 00/25 VUs  04.9s/30s  20.00 iters/s

running (0m06.0s), 00/25 VUs, 119 complete and 0 interrupted iterations
chat   [  20% ] 00/25 VUs  05.9s/30s  20.00 iters/s

running (0m07.0s), 00/25 VUs, 139 complete and 0 interrupted iterations
chat   [  23% ] 00/25 VUs  06.9s/30s  20.00 iters/s

running (0m08.0s), 00/25 VUs, 159 complete and 0 interrupted iterations
chat   [  26% ] 00/25 VUs  07.9s/30s  20.00 iters/s

running (0m09.0s), 00/25 VUs, 179 complete and 0 interrupted iterations
chat   [  30% ] 00/25 VUs  08.9s/30s  20.00 iters/s

running (0m10.0s), 00/25 VUs, 199 complete and 0 interrupted iterations
chat   [  33% ] 00/25 VUs  09.9s/30s  20.00 iters/s

running (0m11.0s), 00/25 VUs, 219 complete and 0 interrupted iterations
chat   [  36% ] 00/25 VUs  10.9s/30s  20.00 iters/s

running (0m12.0s), 00/25 VUs, 239 complete and 0 interrupted iterations
chat   [  40% ] 00/25 VUs  11.9s/30s  20.00 iters/s

running (0m13.0s), 00/25 VUs, 259 complete and 0 interrupted iterations
chat   [  43% ] 00/25 VUs  12.9s/30s  20.00 iters/s

running (0m14.0s), 00/25 VUs, 279 complete and 0 interrupted iterations
chat   [  46% ] 00/25 VUs  13.9s/30s  20.00 iters/s

running (0m15.0s), 00/25 VUs, 299 complete and 0 interrupted iterations
chat   [  50% ] 00/25 VUs  14.9s/30s  20.00 iters/s

running (0m16.0s), 00/25 VUs, 319 complete and 0 interrupted iterations
chat   [  53% ] 00/25 VUs  15.9s/30s  20.00 iters/s

running (0m17.0s), 00/25 VUs, 339 complete and 0 interrupted iterations
chat   [  56% ] 00/25 VUs  16.9s/30s  20.00 iters/s

running (0m18.0s), 00/25 VUs, 359 complete and 0 interrupted iterations
chat   [  60% ] 00/25 VUs  17.9s/30s  20.00 iters/s

running (0m19.0s), 00/25 VUs, 379 complete and 0 interrupted iterations
chat   [  63% ] 00/25 VUs  18.9s/30s  20.00 iters/s

running (0m20.0s), 00/25 VUs, 399 complete and 0 interrupted iterations
chat   [  66% ] 00/25 VUs  19.9s/30s  20.00 iters/s

running (0m21.0s), 00/25 VUs, 419 complete and 0 interrupted iterations
chat   [  70% ] 00/25 VUs  20.9s/30s  20.00 iters/s

running (0m22.0s), 00/25 VUs, 439 complete and 0 interrupted iterations
chat   [  73% ] 00/25 VUs  21.9s/30s  20.00 iters/s

running (0m23.0s), 00/25 VUs, 459 complete and 0 interrupted iterations
chat   [  76% ] 00/25 VUs  22.9s/30s  20.00 iters/s

running (0m24.0s), 00/25 VUs, 479 complete and 0 interrupted iterations
chat   [  80% ] 00/25 VUs  23.9s/30s  20.00 iters/s

running (0m25.0s), 00/25 VUs, 499 complete and 0 interrupted iterations
chat   [  83% ] 00/25 VUs  24.9s/30s  20.00 iters/s

running (0m26.0s), 00/25 VUs, 519 complete and 0 interrupted iterations
chat   [  86% ] 00/25 VUs  25.9s/30s  20.00 iters/s

running (0m27.0s), 00/25 VUs, 539 complete and 0 interrupted iterations
chat   [  90% ] 00/25 VUs  26.9s/30s  20.00 iters/s

running (0m28.0s), 00/25 VUs, 559 complete and 0 interrupted iterations
chat   [  93% ] 00/25 VUs  27.9s/30s  20.00 iters/s

running (0m29.0s), 00/25 VUs, 579 complete and 0 interrupted iterations
chat   [  96% ] 00/25 VUs  28.9s/30s  20.00 iters/s

running (0m30.0s), 00/25 VUs, 599 complete and 0 interrupted iterations
chat   [ 100% ] 00/25 VUs  29.9s/30s  20.00 iters/s


  █ THRESHOLDS 

    http_req_duration{name:/api/chat}
    ✓ 'p(95)<400' p(95)=4.89ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 601     19.972675/s
    checks_succeeded...: 100.00% 601 out of 601
    checks_failed......: 0.00%   0 out of 601

    ✓ chat 2xx

    HTTP
    http_req_duration..............: avg=3.07ms min=832µs    med=2.93ms max=81.67ms p(90)=4.52ms p(95)=4.89ms
      { expected_response:true }...: avg=3.07ms min=832µs    med=2.93ms max=81.67ms p(90)=4.52ms p(95)=4.89ms
      { name:/api/chat }...........: avg=2.94ms min=832µs    med=2.93ms max=19.01ms p(90)=4.52ms p(95)=4.89ms
    http_req_failed................: 0.00%  0 out of 602
    http_reqs......................: 602    20.005907/s

    EXECUTION
    iteration_duration.............: avg=3.36ms min=981.12µs med=3.41ms max=19.35ms p(90)=5.05ms p(95)=5.51ms
    iterations.....................: 601    19.972675/s
    vus............................: 0      min=0        max=0 
    vus_max........................: 25     min=25       max=25

    NETWORK
    data_received..................: 350 kB 12 kB/s
    data_sent......................: 299 kB 9.9 kB/s



running (0m30.1s), 00/25 VUs, 601 complete and 0 interrupted iterations
chat ✓ [ 100% ] 00/25 VUs  30s  20.00 iters/s